app/Http/Controllers/BookController.php

    public function show()
    {
        return view(
            "components.book.index",
            [
                'books' => Book::with('media')->get()
            ]
        );
---
select * from `books`